afractal.node-essentials
akamud.vscode-theme-onedark
alexcvzz.vscode-sqlite
amazonwebservices.amazon-q-vscode
amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
batisteo.vscode-django
be5invis.vscode-icontheme-nomo-dark
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
chris-noring.node-snippets
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
file-icons.file-icons
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
frhtylcn.pythonsnippets
github.github-vscode-theme
github.vscode-pull-request-github
hashicorp.terraform
humao.rest-client
inferrinizzard.prettier-sql-vscode
kevinrose.vsc-python-indent
lirobi.phone-preview
localstack.localstack
mikestead.dotenv
mintlify.document
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.azure-account
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
msjsdiag.vscode-react-native
mtxr.sqltools
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
njpwerner.autodocstring
njqdev.vscode-python-typehint
orta.vscode-jest
pkief.material-icon-theme
redhat.fabric8-analytics
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
sygene.auto-correct
typescriptteam.native-preview
usernamehw.errorlens
vscode-icons-team.vscode-icons
wallabyjs.quokka-vscode
wayou.file-icons-mac
wholroyd.jinja
wix.vscode-import-cost
zhuangtongfa.material-theme
